Console.Clear ();

Console.WriteLine("Введите число:");
int n = Convert.ToInt32(Console.ReadLine());

if (n < 99)
Console.WriteLine($"У числа нет третьей цифры");
else
while (n > 999) 
{
    n = n / 10;
}

int n1 = n % 10;

if (n < 99)
Console.WriteLine($"У числа нет третьей цифры");
else
Console.WriteLine($"Третья цифра {n1}");

// n=10 
//  если 10 меньше 99 да  Console.WriteLine($"У числа нет третьей цифры");
//
// n=100
// если 100  меьше 99 нет 
// еще пока 100 больше 999 нет тогда вводим новое значение n1 которое равно поледней цифре числа Console.WriteLine($"Третья цифра {n1}");
// циклим  пока не сделам трехзначное число
// n=1000
// если 100  меьше 99 нет 
// еще пока 1000 больше 999 да тогда 1000/10=100 теперь n=100 вводим новое значение n1 которое равно поледней цифре числа Console.WriteLine($"Третья цифра {n1}");
